; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_2 ?v2 - type_3 ?v3 - type_1)
 	      (pred_3 ?v5 - object ?v3 - type_1)
	      (pred_1 ?v2 - type_3 ?v8 - type_2)
	      (pred_4 ?v2 - type_3 ?v5 - object ?v8 - type_2))

   (:action op_1
       :parameters  (?v2 - type_3 ?v1 ?v4 - type_1)
       :precondition (and  (pred_2 ?v2 ?v1))
       :effect (and  (pred_2 ?v2 ?v4)
		     (not (pred_2 ?v2 ?v1))))

   (:action op_2
       :parameters (?v2 - type_3 ?v6 - object ?v7 - type_1 ?v8 - type_2)
       :precondition  (and  (pred_3 ?v6 ?v7) (pred_2 ?v2 ?v7) (pred_1 ?v2 ?v8))
       :effect (and (pred_4 ?v2 ?v6 ?v8)
		    (not (pred_3 ?v6 ?v7)) 
		    (not (pred_1 ?v2 ?v8))))

   (:action op_3
       :parameters (?v2 - type_3 ?v6 - object ?v7 - type_1 ?v8 - type_2)
       :precondition  (and  (pred_4 ?v2 ?v6 ?v8) (pred_2 ?v2 ?v7))
       :effect (and (pred_3 ?v6 ?v7)
		    (pred_1 ?v2 ?v8)
		    (not (pred_4 ?v2 ?v6 ?v8)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_03 obj_11 - type_3
obj_10 obj_14 obj_09 obj_08 - type_2
obj_02 obj_12 obj_13 obj_07 - type_1
obj_06 obj_04 obj_01 obj_05 - object)
(:init
(pred_2 obj_03 obj_07)
(pred_1 obj_03 obj_10)
(pred_1 obj_03 obj_14)
(pred_2 obj_11 obj_12)
(pred_1 obj_11 obj_09)
(pred_1 obj_11 obj_08)
(pred_3 obj_06 obj_13)
(pred_3 obj_04 obj_12)
(pred_3 obj_01 obj_07)
(pred_3 obj_05 obj_12)
)
(:goal
(and
(pred_3 obj_06 obj_02)
(pred_3 obj_04 obj_13)
(pred_3 obj_01 obj_07)
(pred_3 obj_05 obj_07)
)
)

(:constraints
  (always (not (pred_2 obj_03 obj_13)))
)
)

; plan
1. (op_1 obj_03 obj_07 obj_02)
   deleted: (pred_2 obj_03 obj_07)
   added: (pred_2 obj_03 obj_02)
   goals met: 1 of 4
2. (op_2 obj_11 obj_05 obj_12 obj_08)
   deleted: (pred_3 obj_05 obj_12) (pred_1 obj_11 obj_08)
   added: (pred_4 obj_11 obj_05 obj_08)
   goals met: 1 of 4
3. (op_2 obj_11 obj_04 obj_12 obj_09)
   deleted: (pred_3 obj_04 obj_12) (pred_1 obj_11 obj_09)
   added: (pred_4 obj_11 obj_04 obj_09)
   goals met: 1 of 4
4. (op_1 obj_11 obj_12 obj_07)
   deleted: (pred_2 obj_11 obj_12)
   added: (pred_2 obj_11 obj_07)
   goals met: 1 of 4
5. (op_3 obj_11 obj_05 obj_07 obj_08)
   deleted: (pred_4 obj_11 obj_05 obj_08)
   added: (pred_3 obj_05 obj_07) (pred_1 obj_11 obj_08)
   goals met: 2 of 4
6. (op_1 obj_11 obj_07 obj_13)
   deleted: (pred_2 obj_11 obj_07)
   added: (pred_2 obj_11 obj_13)
   goals met: 2 of 4
7. (op_3 obj_11 obj_04 obj_13 obj_09)
   deleted: (pred_4 obj_11 obj_04 obj_09)
   added: (pred_3 obj_04 obj_13) (pred_1 obj_11 obj_09)
   goals met: 3 of 4
8. (op_2 obj_11 obj_06 obj_13 obj_08)
   deleted: (pred_3 obj_06 obj_13) (pred_1 obj_11 obj_08)
   added: (pred_4 obj_11 obj_06 obj_08)
   goals met: 3 of 4
9. (op_1 obj_11 obj_13 obj_02)
   deleted: (pred_2 obj_11 obj_13)
   added: (pred_2 obj_11 obj_02)
   goals met: 3 of 4
10. (op_3 obj_11 obj_06 obj_02 obj_08)
   deleted: (pred_4 obj_11 obj_06 obj_08)
   added: (pred_3 obj_06 obj_02) (pred_1 obj_11 obj_08)
   goals met: 4 of 4
